/*
subroutine starts with the routine’s name in the form of a label. The procedure instruction on the first
line of the subroutine ensures that only the arguments passed to the subroutine will be accessable from
within it. No other variables of the calling routine are viewable or changeable by this subroutine. Here is
the first executable line of the subroutine:*/
call digits
say 'square_the_number:' procedure
